app/views/likes/_likes.html.erb

<% end %>
<%= post.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]