app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<% @users = User.all %>