app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
		<div class="email"><%=@user.email%></div>
		<div class="posts-num"><%= @user_posts.size %> posts</div>