app/views/posts/show.html.erb

		<div class="comments-list">
			<% @post.post_comment.each do |comment|%>
				<div class="comment">
					<% user = User.find(comment.user_id) %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ? ORDER BY created_at DESC  [["post_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]