app/controllers/likes_controller.rb

  def create
    @post.likes.where(user_id: current_user.id).first_or_create
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["created_at", 2017-05-16 03:55:00 UTC], ["updated_at", 2017-05-16 03:55:00 UTC]]
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? ORDER BY "likes"."id" ASC LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]

  def destroy
    @post.likes.where(user_id: current_user.id).destroy_all
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ?  [["post_id", 1], ["user_id", 1]]