app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(permit_post)
    if @post.save
---
INSERT INTO "posts" ("description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["description", ""], ["created_at", 2017-05-07 12:49:14 UTC], ["updated_at", 2017-05-07 12:49:14 UTC], ["user_id", 1]]