app/controllers/post_comments_controller.rb

  def create
    @post_comment = PostComment.new(post_comment_params)
    @post_comment.user_id = current_user.id

    respond_to do |format|
      if @post_comment.save
---
INSERT INTO "post_comments" ("user_id", "post_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["comment", "i love her"], ["created_at", 2017-05-07 12:47:30 UTC], ["updated_at", 2017-05-07 12:47:30 UTC]]