app/controllers/searches_controller.rb

SELECT  "users".* FROM "users" WHERE (lower(email) LIKE '%s%') ORDER BY "users"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (lower(email) LIKE '%a%')
---
  def index
    @searches = User.where("lower(email) LIKE ?", '%' + params[:email].downcase + '%').paginate(page: params[:page], per_page: 10).order(:id)