app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def following
    @user  = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def followers
    @user  = User.find(params[:id])

SELECT "users".* FROM "users" WHERE (lower(email) LIKE '%s%')
---
  def live_search
		if(params[:email])
		    @users = User.where("lower(email) LIKE ?", '%' + params[:email].downcase + '%')